# config.py

import math

# ==========================================================================
# マシンスペック
# ==========================================================================
MACHINE_MAX_X_MM = 730
MACHINE_MAX_Y_MM = 300


# ==========================================================================
# Dynamixel モーター設定
# ==========================================================================
DXL_PROTOCOL_VERSION = 2.0
DXL_BAUDRATE = 57600
DEVICENAME = "COM5"
DXL_IDS = { 'x': 1, 'y': 2, 'z': 4 }
MOTOR_DIRECTIONS = { 'x': -1, 'y': -1, 'z': 1 ,'z*1':1 ,'z*-1':-1}


# ==========================================================================
# 単位換算設定
# ==========================================================================
DXL_PULSES_PER_REVOLUTION = 4096
PULSES_PER_MM_X = 46.56
PULSES_PER_MM_Y = 46.56
PULSES_PER_MM_Z = 1024.0


# ==========================================================================
# 動作パラメータ (プリセットに移行しないもの)
# ==========================================================================
# 起動時に選択されるデフォルトのプリセット名を指定
DEFAULT_PRESET_NAME = "下記から選択"

# Z軸の速度・加速度
PROFILE_VELOCITY_Z = 0
PROFILE_ACCELERATION_Z = 0
# 20000と300だっだけど０にした．溶着中ｚ軸上がらなくなる
# 速め
# VELOCITY = 20000
# ACCELERATION = 300
# 遅め
# VELOCITY = 1000
# ACCELERATION = 100
#0だとmaxの値になる

# 安全な高さ (パルス位置)
SAFE_Z_PULSE = 2100
# 全ての工程が完了した後の、最終的なZ軸の退避高さ
FINAL_RETRACT_PULSE = 1100
# モーターが移動できる範囲の最小値と最大値（パルス）を設定
Z_LIMIT_MAX_PULSE = 2337 #Ｚ軸が一番下の時のパルス値
Z_LIMIT_MIN_PULSE = 1121 #Ｚ軸が一番上の時のパルス値

# ==========================================================================
# 原点復帰パラメータ
# ==========================================================================
# 速度は0~330まで
# 加速度は100が良い．速くしたいなら150で，ゆっくりしたいなら50
HOMING_VELOCITY_SIGN = { 'x': 1, 'y': 1 }
# センサーに高速で接近する際の速度
HOMING_SPEED_FAST = 330
# 初回アプローチ（高速移動）時の加速度
HOMING_APPROACH_ACCELERATION = 150

# バックオフ速度設定
HOMING_BACKOFF_SPEED = 330
HOMING_BACKOFF_TIMEOUT = 5.0
# バックオフ時の加速度
HOMING_BACKOFF_ACCELERATION = 100
# センサーから離れる距離 (mm)
HOMING_BACKOFF_MM = 10

# センサーに低速で再接触する際の速度
HOMING_SPEED_SLOW = 30
# 低速接近（原点確定）時の加速度
HOMING_SLOW_ACCELERATION = 50

# ==========================================================================
# 経路計算パラメータ (プリセットに移行しないもの)
# ==========================================================================
# DXF内の円や円弧を、いくつの短い直線で近似するかを指定
CURVE_SEGMENTS = 20


# ==========================================================================
# I/O（周辺機器）設定
# ==========================================================================
WELDER_PIN = 0
LIMIT_SWITCH_X_PIN = 1
LIMIT_SWITCH_Y_PIN = 2

# 物理的な緊急停止ボタンを接続するデジタル入力(DI)ピン
EMERGENCY_STOP_PIN = 3